# <center>[Pandas DataFrame: Exercises, Practice, Solution](https://www.w3resource.com/python-exercises/pandas/index-dataframe.php)</center>

### 1. Write a Pandas program to get the powers of an array values element-wise.

Note: First array elements raised to powers from second array. <br> <br>
Sample data: {'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]} <br> <br>
Expected Output: <br>
X Y Z <br>
0 78 84 86 <br>
1 85 94 97 <br>
2 96 89 96 <br>
3 80 83 72 <br>
4 86 86 83

N.B: Questions seems unclear to me. Though I checked sample solution and it matched with my below solution.

In [1]:
# Importing necessary libraries for all problems:

import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]})
df

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83

### 2. Write a Pandas program to create and display a DataFrame from a specified dictionary data which has the index labels. <br>
Sample Python dictionary data and list labels: <br> <br>
**exam_data** = *{'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'], <br>
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19], <br>
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1], <br>
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']} <br>
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']*

In [3]:
exam_data  = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(exam_data, index = labels)

print(df)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

### 3. Write a Pandas program to display a summary of the basic information about a specified DataFrame and its data.

Sample Python dictionary data and list labels: <br> <br>
**exam_data** = *{'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'], <br>
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19], <br>
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1], <br>
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']} <br>
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']*

In [4]:
exam_data  = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(exam_data, index = labels)

df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
name        10 non-null object
score       8 non-null float64
attempts    10 non-null int64
qualify     10 non-null object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

### 4. Write a Pandas program to get the first 3 rows of a given DataFrame.

In [5]:
# Solution: 1

df.head(3)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

In [6]:
# Solution: 2

df.iloc[:3, :]

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

### 5. Write a Pandas program to select the 'name' and 'score' columns from the above (exam_data) DataFrame.

In [7]:
df[['name', 'score']]

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

### 6. Write a Pandas program to select the specified columns and rows from a given data frame.

Select 'name' and 'score' columns in rows 1, 3, 5, 6 from the following data frame.

In [8]:
# Solution 1:

df[['name', 'score']].iloc[[1, 3, 5, 6], :]

      name  score
b     Dima    9.0
d    James    NaN
f  Michael   20.0
g  Matthew   14.5

In [9]:
# Solution 2:

df.iloc[[1, 3, 5, 6], [0, 1]]

      name  score
b     Dima    9.0
d    James    NaN
f  Michael   20.0
g  Matthew   14.5

### 7. Write a Pandas program to select the rows where the number of attempts in the examination is greater than 2.

In [10]:
df[df['attempts'] > 2][['name', 'score']]

      name  score
b     Dima    9.0
d    James    NaN
f  Michael   20.0

### 8. Write a Pandas program to count the number of rows and columns of a DataFrame.

In [11]:
print('Number of rows of DataFrame:', df.shape[0])
print('Number of columns of DataFrame:', df.shape[1])

Number of rows of DataFrame: 10
Number of columns of DataFrame: 4

### 9. Write a Pandas program to select the rows where the score is missing, i.e. is NaN.

In [12]:
print(df[df['score'].isnull()])

    name  score  attempts qualify
d  James    NaN         3      no
h  Laura    NaN         1      no

### 10. Write a Pandas program to select the rows the score is between 15 and 20 (inclusive).

In [13]:
print(df[(df['score'] >= 15) & (df['score'] <= 20)])

        name  score  attempts qualify
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes

### 11. Write a Pandas program to select the rows where number of attempts in the examination is less than 3 and score greater than 15.

In [14]:
print(df[(df['attempts'] < 3) & (df['score'] > 15)])

        name  score  attempts qualify
c  Katherine   16.5         2     yes
j      Jonas   19.0         1     yes

### 12. Write a Pandas program to change the score in row 'd' to 11.5.

In [15]:
# Solution 1: 

df['score'].loc['d'] = 11.5
df['score']

C:\Users\green\Anaconda3\lib\site-packages\pandas\core\indexing.py:190: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self._setitem_with_indexer(indexer, value)

a    12.5
b     9.0
c    16.5
d    11.5
e     9.0
f    20.0
g    14.5
h     NaN
i     8.0
j    19.0
Name: score, dtype: float64

In [16]:
# Solution 2:

df.loc['d', 'score'] = 11.5
df['score']

a    12.5
b     9.0
c    16.5
d    11.5
e     9.0
f    20.0
g    14.5
h     NaN
i     8.0
j    19.0
Name: score, dtype: float64

### 13. Write a Pandas program to calculate the sum of the examination attempts by the students.

In [17]:
print('Sum of the examination attempts by the students:', df['attempts'].sum())

Sum of the examination attempts by the students: 19

### 14. Write a Pandas program to calculate the mean score for each different student in DataFrame.

In [18]:
exam_data  = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(exam_data , index=labels)
print("\nMean score for each different student in data frame:", df['score'].mean())

Mean score for each different student in data frame: 13.5625

### 15. Write a Pandas program to append a new row 'k' to data frame with given values for each column. Now delete the new row and return the original DataFrame.

In [19]:
df.loc['k'] = ['Suresh', 15.5, 'yes', 1]     # This line is similar to adding new data in SQL. 
print('Dataframe after adding new rows: ')
print(df)

print('\n')
# df = df.drop('k')      # We need to assign df = df.drop('k'), to perform inplace drop of row. Only df.drop('k') won't work.
df.drop('k', inplace = True)
print('Dataframe after removing the added rows:')
print(df)

Dataframe after adding new rows:
        name  score attempts qualify
a  Anastasia   12.5        1     yes
b       Dima    9.0        3      no
c  Katherine   16.5        2     yes
d      James    NaN        3      no
e      Emily    9.0        2      no
f    Michael   20.0        3     yes
g    Matthew   14.5        1     yes
h      Laura    NaN        1      no
i      Kevin    8.0        2      no
j      Jonas   19.0        1     yes
k     Suresh   15.5      yes       1


Dataframe after removing the added rows:
        name  score attempts qualify
a  Anastasia   12.5        1     yes
b       Dima    9.0        3      no
c  Katherine   16.5        2     yes
d      James    NaN        3      no
e      Emily    9.0        2      no
f    Michael   20.0        3     yes
g    Matthew   14.5        1     yes
h      Laura    NaN        1      no
i      Kevin    8.0        2      no
j      Jonas   19.0        1     yes

### 16. Write a Pandas program to sort the DataFrame first by 'name' in descending order, then by 'score' in ascending order.

In [20]:
df.sort_values(by = ['name', 'score'], ascending = [False, True])

        name  score attempts qualify
f    Michael   20.0        3     yes
g    Matthew   14.5        1     yes
h      Laura    NaN        1      no
i      Kevin    8.0        2      no
c  Katherine   16.5        2     yes
j      Jonas   19.0        1     yes
d      James    NaN        3      no
e      Emily    9.0        2      no
b       Dima    9.0        3      no
a  Anastasia   12.5        1     yes

### 17. Write a Pandas program to replace the 'qualify' column contains the values 'yes' and 'no' with True and False.

In [27]:
def rename(col):
    qualify = col[0]
    if 'yes':
        return True
    else:
        return False
    
# renamed_qualify = list(map(rename, df['qualify']))
renamed_qualify = df['qualify'].apply(rename)
renamed_qualify

a    True
b    True
c    True
d    True
e    True
f    True
g    True
h    True
i    True
j    True
Name: qualify, dtype: bool

### 18. Write a Pandas program to change the name 'James' to 'Suresh' in name column of the DataFrame.

In [45]:
df['name'].replace('James', 'Suresh', inplace = True)
df    # We can see the changed name in index row 'd'.

        name  score attempts qualify
a  Anastasia   12.5        1     yes
b       Dima    9.0        3      no
c  Katherine   16.5        2     yes
d     Suresh    NaN        3      no
e      Emily    9.0        2      no
f    Michael   20.0        3     yes
g    Matthew   14.5        1     yes
h      Laura    NaN        1      no
i      Kevin    8.0        2      no
j      Jonas   19.0        1     yes

### 19. Write a Pandas program to delete the 'attempts' column from the DataFrame.

In [51]:
exam_data  = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(exam_data , index=labels)

df.drop('attempts', axis = 1, inplace = True)
df

        name  score qualify
a  Anastasia   12.5     yes
b       Dima    9.0      no
c  Katherine   16.5     yes
d      James    NaN      no
e      Emily    9.0      no
f    Michael   20.0     yes
g    Matthew   14.5     yes
h      Laura    NaN      no
i      Kevin    8.0      no
j      Jonas   19.0     yes

### 20. Write a Pandas program to insert a new column in existing DataFrame.

In [57]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(data = exam_data, index = labels)

df['color'] = ['Red','Blue','Orange','Red','White','White','Blue','Green','Green','Red']
print('DataFrame after adding Color column:')
df

DataFrame after adding Color column:

        name  score  attempts qualify   color
a  Anastasia   12.5         1     yes     Red
b       Dima    9.0         3      no    Blue
c  Katherine   16.5         2     yes  Orange
d      James    NaN         3      no     Red
e      Emily    9.0         2      no   White
f    Michael   20.0         3     yes   White
g    Matthew   14.5         1     yes    Blue
h      Laura    NaN         1      no   Green
i      Kevin    8.0         2      no   Green
j      Jonas   19.0         1     yes     Red

### 21. Write a Pandas program to iterate over rows in a DataFrame.